cf/DataProcessors/обЗаработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>обЗаработок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантГруппировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыГруппировкиОтчетаЗаработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/AccumulationRegisters/Заработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Заработок</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заказчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/ВариантыГруппировкиОтчетаЗаработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВариантыГруппировкиОтчетаЗаработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПериоду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказчику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/обЗаработок/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()

	Обработка = РеквизитФормыВЗначение("Объект");	
	
	Макет = Обработка.ПолучитьМакет("Макет");
	
	ТабличныйДокумент = ТабДок;
	ТабличныйДокумент.Очистить();
	
	облЗаголовок 	= Макет.ПолучитьОбласть("ОблЗаголовок");
	облШапка 		= Макет.ПолучитьОбласть("облШапка");
	облСтрока 		= Макет.ПолучитьОбласть("ОблСтрока");
	облИтого 		= Макет.ПолучитьОбласть("облИтого");
	облМесяц		= Макет.ПолучитьОбласть("облМесяц");

	ТабличныйДокумент.Вывести(облЗаголовок);
	ТабличныйДокумент.Вывести(облШапка);
	
	Если Объект.ВариантГруппировки = Перечисления.ВариантыГруппировкиОтчетаЗаработок.ПоЗаказчику тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаработокОбороты.Заказчик КАК Заказчик,
			|	ЗаработокОбороты.СуммаОборот КАК СуммаОборот,
			|	ЗаработокОбороты.ПериодМесяц КАК ПериодМесяц
			|ИЗ
			|	РегистрНакопления.Заработок.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Авто,
			|			ВЫБОР
			|				КОГДА &Заказчик = НЕОПРЕДЕЛЕНО
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ Заказчик = &Заказчик
			|			КОНЕЦ) КАК ЗаработокОбороты
			|
			|УПОРЯДОЧИТЬ ПО
			|	СуммаОборот УБЫВ
			|ИТОГИ
			|	СУММА(СуммаОборот)
			|ПО
			|	ОБЩИЕ,
			|	Заказчик";
		
	ИначеЕсли Объект.ВариантГруппировки = Перечисления.ВариантыГруппировкиОтчетаЗаработок.ПоПериоду тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаработокОбороты.Заказчик КАК Заказчик,
			|	ЗаработокОбороты.СуммаОборот КАК СуммаОборот,
			|	ЗаработокОбороты.ПериодМесяц КАК ПериодМесяц
			|ИЗ
			|	РегистрНакопления.Заработок.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Авто,
			|			ВЫБОР
			|				КОГДА &Заказчик = НЕОПРЕДЕЛЕНО
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ Заказчик = &Заказчик
			|			КОНЕЦ) КАК ЗаработокОбороты
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПериодМесяц УБЫВ
			|ИТОГИ
			|	СУММА(СуммаОборот)
			|ПО
			|	ОБЩИЕ,
			|	ПериодМесяц";
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Заказчик", ?(ЗначениеЗаполнено(Заказчик),Заказчик,Неопределено));
	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(КонецПериода),КонецПериода,Дата(2999,12,31,23,59,59)));
	Запрос.УстановитьПараметр("НачалоПериода", ?(ЗначениеЗаполнено(НачалоПериода),НачалоПериода,Дата(1,1,1,0,0,0)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	облИтого.Параметры.Сумма = ВыборкаОбщийИтог.СуммаОборот;
	ТабличныйДокумент.Вывести(облИтого,1);
	
	ВыборкаПериодМесяц = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПериодМесяц.Следующий() Цикл
		Если Объект.ВариантГруппировки = Перечисления.ВариантыГруппировкиОтчетаЗаработок.ПоЗаказчику тогда
			облМесяц.Параметры.Месяц = ВыборкаПериодМесяц.Заказчик;
			облМесяц.Параметры.Сумма = ВыборкаПериодМесяц.СуммаОборот;	
		ИначеЕсли Объект.ВариантГруппировки = Перечисления.ВариантыГруппировкиОтчетаЗаработок.ПоПериоду тогда
			облМесяц.Параметры.Месяц = Формат(ВыборкаПериодМесяц.ПериодМесяц, "ДФ='MMММ yyyy'");
			облМесяц.Параметры.Сумма = ВыборкаПериодМесяц.СуммаОборот;
		КонецЕсли;
		ТабличныйДокумент.Вывести(облМесяц,2);
	
		ВыборкаДетальныеЗаписи = ВыборкаПериодМесяц.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			облСтрока.Параметры.Заказчик = ВыборкаДетальныеЗаписи.Заказчик;
			облСтрока.Параметры.Сумма = ВыборкаДетальныеЗаписи.СуммаОборот;
			ТабличныйДокумент.Вывести(облСтрока,3);
		КонецЦикла;
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(1);

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВариантГруппировки = Перечисления.ВариантыГруппировкиОтчетаЗаработок.ПоПериоду;
	
КонецПроцедуры
